CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_syscfg.h
/*!
    \file    gd32w51x_syscfg.h
    \brief   definitions for the SYSCFG

    \version 2021-03-25, V1.0.0, firmware for GD32W51x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32W51X_SYSCFG_H
#define GD32W51X_SYSCFG_H

#include "gd32w51x.h"

#define SYSCFG         SYSCFG_BASE

/* registers definitions */
#define SYSCFG_CFG0                             REG32(SYSCFG + 0x00000000U)                       /*!< SYSCFG configuration register 0 */
#define SYSCFG_EXTISS0                          REG32(SYSCFG + 0x00000008U)                       /*!< EXTI sources selection register 0 */
#define SYSCFG_EXTISS1                          REG32(SYSCFG + 0x0000000CU)                       /*!< EXTI sources selection register 1 */
#define SYSCFG_EXTISS2                          REG32(SYSCFG + 0x00000010U)                       /*!< EXTI sources selection register 2 */
#define SYSCFG_EXTISS3                          REG32(SYSCFG + 0x00000014U)                       /*!< EXTI sources selection register 3 */
#define SYSCFG_CPSCTL                           REG32(SYSCFG + 0x00000020U)                       /*!< I/O compensation control register */
#define SYSCFG_SECCFG                           REG32(SYSCFG + 0x00000040U)                       /*!< SYSCFG secure configuration register */
#define SYSCFG_FPUINTEN                         REG32(SYSCFG + 0x00000048U)                       /*!< FPU interrupt enable register */
#define SYSCFG_CNSLOCK                          REG32(SYSCFG + 0x0000004CU)                       /*!< SYSCFG CPU non-secure lock register */
#define SYSCFG_CSLOCK                           REG32(SYSCFG + 0x00000050U)                       /*!< SYSCFG CPU secure lock register */
#define SYSCFG_CFG1                             REG32(SYSCFG + 0x00000054U)                       /*!< SYSCFG configuration register 1 */
#define SYSCFG_SCS                              REG32(SYSCFG + 0x00000058U)                       /*!< SYSCFG SRAM1 control and status register */
#define SYSCFG_SKEY                             REG32(SYSCFG + 0x0000005CU)                       /*!< SYSCFG SRAM1 key register */
#define SYSCFG_SWP0                             REG32(SYSCFG + 0x00000060U)                       /*!< SYSCFG SRAM1 write protection register 0 */
#define SYSCFG_SWP1                             REG32(SYSCFG + 0x00000064U)                       /*!< SYSCFG SRAM1 write protection register 1 */
#define SYSCFG_GSSACMD                           REG32(SYSCFG + 0x0000006CU)                       /*!< SYSCFG GSSA command register */

/* bits definitions */
/* SYSCFG_CFG0 */
#define SYSCFG_CFG0_BOOT_MODE                   BITS(0,1)                                         /*!< Boot mode */

/* SYSCFG_EXTISS0 bits definitions */
#define SYSCFG_EXTISS0_EXTI0_SS                 BITS(0,3)                                         /*!< EXTI 0 source selection */
#define SYSCFG_EXTISS0_EXTI1_SS                 BITS(4,7)                                         /*!< EXTI 1 source selection */
#define SYSCFG_EXTISS0_EXTI2_SS                 BITS(8,11)                                        /*!< EXTI 2 source selection */
#define SYSCFG_EXTISS0_EXTI3_SS                 BITS(12,15)                                       /*!< EXTI 3 source selection */

/* SYSCFG_EXTISS1 bits definitions */
#define SYSCFG_EXTISS1_EXTI4_SS                 BITS(0,3)                                         /*!< EXTI 4 source selection */
#define SYSCFG_EXTISS1_EXTI5_SS                 BITS(4,7)                                         /*!< EXTI 5 source selection */
#define SYSCFG_EXTISS1_EXTI6_SS                 BITS(8,11)                                        /*!< EXTI 6 source selection */
#define SYSCFG_EXTISS1_EXTI7_SS                 BITS(12,15)                                       /*!< EXTI 7 source selection */

/* SYSCFG_EXTISS2 bits definitions */
#define SYSCFG_EXTISS2_EXTI8_SS                 BITS(0,3)                                         /*!< EXTI 8 source selection */
#define SYSCFG_EXTISS2_EXTI9_SS                 BITS(4,7)                                         /*!< EXTI 9 source selection */
#define SYSCFG_EXTISS2_EXTI10_SS                BITS(8,11)                                        /*!< EXTI 10 source selection */
#define SYSCFG_EXTISS2_EXTI11_SS                BITS(12,15)                                       /*!< EXTI 11 source selection */

/* SYSCFG_EXTISS3 bits definitions */
#define SYSCFG_EXTISS3_EXTI12_SS                BITS(0,3)                                         /*!< EXTI 12 source selection */
#define SYSCFG_EXTISS3_EXTI13_SS                BITS(4,7)                                         /*!< EXTI 13 source selection */
#define SYSCFG_EXTISS3_EXTI14_SS                BITS(8,11)                                        /*!< EXTI 14 source selection */
#define SYSCFG_EXTISS3_EXTI15_SS                BITS(12,15)                                       /*!< EXTI 15 source selection */

/* SYSCFG_CPSCTL */
#define SYSCFG_CPSCTL_CPS_EN                    BIT(0)                                            /*!< Compensation cell power-down */
#define SYSCFG_CPSCTL_CPS_RDY                   BIT(8)                                            /*!< Compensation cell ready flag */

/* SYSCFG_SECCFG */
#define SYSCFG_SECCFG_SYSCFGSE                  BIT(0)                                            /*!< SYSCFG clock control security */
#define SYSCFG_SECCFG_CLASSBSE                  BIT(1)                                            /*!< ClassB security */
#define SYSCFG_SECCFG_SRAM1SE                   BIT(2)                                            /*!< SRAM1 security */
#define SYSCFG_SECCFG_FPUSE                     BIT(3)                                            /*!< FPU security */

/* SYSCFG_FPUINTEN */
#define SYSCFG_FPUINTEN_IOPIZ                  BIT(0)                                            /*!< invalid operation Interrupt enable */
#define SYSCFG_FPUINTEN_DZIE                   BIT(1)                                            /*!< divide-by-zero interrupt enable */
#define SYSCFG_FPUINTEN_UFIE                   BIT(2)                                            /*!< underflow interrupt enable */
#define SYSCFG_FPUINTEN_OVFIE                  BIT(3)                                            /*!< overflow interrupt enable */
#define SYSCFG_FPUINTEN_IDIE                   BIT(4)                                            /*!< input abnormal interrupt enable */
#define SYSCFG_FPUINTEN_IXIE                   BIT(5)                                            /*!< inexact interrupt enable */

/* SYSCFG_CNSLOCK */
#define SYSCFG_CNSLOCK_LOCKNSVTOR               BIT(0)                                            /*!< VTOR_NS register lock */
#define SYSCFG_CNSLOCK_LOCKNSMPU                BIT(1)                                            /*!< Non-secure MPU registers loc */

/* SYSCFG_CSLOCK */
#define SYSCFG_CSLOCK_VTSAIRLK                  BIT(0)                                            /*!< VTOR_S register and AIRCR register bits lock */
#define SYSCFG_CSLOCK_SMPULK                    BIT(1)                                            /*!< Secure MPU registers lock */
#define SYSCFG_CSLOCK_SAULK                     BIT(2)                                            /*!< SAU registers lock */

/* SYSCFG_CFG1 */
#define SYSCFG_CFG1_LOCKUP_LOCK                 BIT(0)                                            /*!< Cortex-M33 LOCKUP (hardfault) output enable bit */
#define SYSCFG_CFG1_LVD_LOCK                    BIT(2)                                            /*!< LVD lock enable bit */

