CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_syscfg.h
/* function configuration */
/* configure the GPIO pin as EXTI Line */
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin);

/* enable the compensation cell */
void compensation_pwdn_mode_enable(void);
/* disable the compensation cell */
void compensation_pwdn_mode_disable(void);

/* configure SYSCFG clock control security */
void syscfg_clock_access_security_config(uint32_t access_mode);
/* configure ClassB security */
void classb_access_security_config(uint32_t access_mode);
/* configure SRAM1 security */
void sram1_access_security_config(uint32_t access_mode);
/* configure FPU security */
void fpu_access_security_config(uint32_t access_mode);
/* disable VTOR_NS register write */
void vtor_ns_write_disable(void);
/* disable Non-secure MPU registers write */
void mpu_ns_write_disable(void);
/* disable VTOR_S register PRIS and BFHFNMINS bits in the AIRCR register write */
void vtors_aircr_write_disable(void);
/* disable secure MPU registers writes */
void mpu_s_write_disable(void);
/* disable SAU registers write */
void sau_write_disable(void);
/* connect TIMER0/15/16 break input to the selected parameter */
void syscfg_lock_config(uint32_t syscfg_lock);
/* write data to GSSA */
void gssacmd_write_data(uint32_t data);

/* SRAM1 operation functions */
/* enable sram1 erase */
ErrStatus sram1_erase(void);
/* unlock the write protection of the SRAM1ERS bit in the SYSCFG_SCS register */
void sram1_unlock(void);
/* lock the write protection of the SRAM1ERS bit in the SYSCFG_SCS register */
void sram1_lock(void);
/* SRAM1 write protect range from page0 to page31 */
void sram1_write_protect_0_31(uint32_t page);
/* SRAM1 write protect range from page32 to page63 */
void sram1_write_protect_32_63(uint32_t page);

/* flag & interrupt functions */
/* get the compensation ready flag */
FlagStatus compensation_ready_flag_get(void);
/* get SRAM1 erase busy flag */
FlagStatus sram1_bsy_flag_get(void);
/* enable floating point unit interrupt */
void fpu_interrupt_enable(uint32_t interrupt);
/* disable floating point unit interrupt */
void fpu_interrupt_disable(uint32_t interrupt);
#endif /* GD32W51X_SYSCFG_H */
